package com.example.myapplication.repositoryes

import com.example.myapplication.dataCalases.CatDataClass

class DogRepository {
    private val dogList = mutableListOf<CatDataClass>()

    fun getDogList() : MutableList<CatDataClass>{
        dogList.add(
            CatDataClass(
                "https://www.proplan.ru/sites/owners.proplan.ru/files/styles/article350x165/public/2020-03/shutterstock_155382377_2.webp?itok=MZGdZRc8",
                "Акита-ину",
                "Среди пород собак, чья история уходит в глубину веков, особо выделяется акита-ину. «Акита» – это префектура в северной части Японии, а «ину» – по-японски «собака». В Азии они были любимыми питомцами при дворе, а со временем акита-ину начала пользоваться привилегиями и у знати. Такая элитность собаки японской акиты очень сказалась на развитии породы в целом. Содержание, кормление и уход за акитой-ину превратились в целую церемонию. Каждая собака имела своего личного слугу. Для них даже изготавливались специальные ошейники и поводки, по которым можно было распознать ранг собаки и положение ее хозяина в обществе. Все вокруг отвечало тому уважению, которым пользовалась акита-ину."
        )
        )
        dogList.add(
            CatDataClass(
                "https://www.proplan.ru/sites/owners.proplan.ru/files/styles/image_768x307/public/2020-03/alabaj-sredneaziatskaya-ovcharka.webp?itok=4r_jdIF0",
                "Алабай или среднеазиатская овчарка",
                "Другое и более правильное название породы – среднеазиатская овчарка (САО) или туркменский алабай. Среднеазиатские овчарки возникли как аборигенная порода на территории Средней Азии в результате народной селекции и естественного отбора. В основу породы легли древние пастушьи и боевые собаки Азии, большой азиатский мастиф, тибетский мастиф. Характеристики среднеазиатской овчарки формировались тысячелетиями длительной службой у человека-кочевника и пастуха. Такое рабочее качество, как охрана территории, жилища и имущества владельца, а также способность самостоятельно принимать решения, заложены у среднеазиатской овчарки на уровне инстинктов."
        )
        )
        dogList.add(
            CatDataClass(
                "https://www.proplan.ru/sites/owners.proplan.ru/files/styles/image_768x307/public/2020-03/shutterstock_1534887686.webp?itok=SHmOvIvu",
                "Американская акита",
                "Американская акита – порода собак с очень интересной судьбой. Казалось бы, из названия уже должно быть понятно, откуда родом эта собака, но все не так просто. Дело в том, что американская акита – родом из Японии. Эта порода даже является символом Страны Восходящего Солнца. Предком американской акиты является акита ину. А второе название породы более соответствует исторической правде – «Большая японская собака». Слово «акита» – обозначало ту территорию, на которой она зародилась как аборигенная; Акита – это префектура, находящаяся в одном из регионов Японии."
        )
        )
        dogList.add(
            CatDataClass(
                "https://www.proplan.ru/sites/owners.proplan.ru/files/styles/article350x165/public/2020-03/amerikanskij-staffordshirskij-terer.webp?itok=LCENyLKx",
                "Краткая информация",
                "Предками американских стаффордширских терьеров были английские породы, в частности стаффордширский бультерьер, ведущий свое начало от староанглийского бульдога и английского терьера. В США он получил названия янки-терьер, пит-дог, американский бультерьер. Здесь селекция стаффордширских терьеров была направлена на увеличение размеров собак и получение особей с мощным телосложением и развитой зубочелюстной системой для собачьих боев и травли животных. Таким образом, были получены питбультерьеры и амстаффы (так сокращенно называют американских стаффордширских терьеров). В 20 веке, после запрета на собачьи бои, американские стаффордширские терьеры стали использоваться для охраны домов, помощи пастухам при выпасе скота и охраны его от диких хищников. В 1935 году эта порода была признана Американским клубом собаководства, в 1972 году порода получила современное название «американский стаффордширский терьер». В России амстаффы были очень популярны в 90-е гг. 20 века."
        )
        )
        dogList.add(
            CatDataClass(
                "https://www.proplan.ru/sites/owners.proplan.ru/files/styles/image_768x307/public/2019-05/anglijskij-buldog.webp?itok=kPSBxcNp",
                "Английский бульдог",
                "Считается, что корни у английских бульдогов общие с догообразными собаками Кавказа, древними римскими мастифами, молосскими догами из Греции и кельтскими сторожевыми собаками. Как именно смешивались гены всех этих собак — история умалчивает, но зато известно, что прародители современных английских бульдогов появились в Англии, в 16-ом веке. Название породы произошло от английского «bull» — бык: порода была выведена специально для травли быков собаками — распространенной забавы для населения Англии. В 1835 году травля была запрещена, и порода оказалась на грани исчезновения. Оставшиеся чистопородные животные стали основателями породы английский бульдог. В 18-ом веке собак этой породы использовали для охоты на кабанов и медведей, а также для собачьих боев."
        )
        )
        dogList.add(
            CatDataClass(
                "https://www.proplan.ru/sites/owners.proplan.ru/files/styles/image_768x307/public/2021-11/shutterstock_685424749.webp?itok=a9hhoW2c",
                "Аргентинский дог",
                "Порода аргентинский дог, или дого аргентино, сравнительно молода. Она появилась лишь в середине XX века, хотя история началась значительно раньше. Предки аргентинского дога – несуществующие ныне бойцовые кордовские собаки приехали в Аргентину с испанцами-завоевателями Нового Света еще в XVI веке."
        )
        )
        dogList.add(
            CatDataClass(
                "https://www.proplan.ru/sites/owners.proplan.ru/files/styles/image_768x307/public/2021-11/basendzhi%201920x767.webp?itok=cRoprlGE",
                "Басенджи",
                "Далекие предки современных басенджи появились примерно в 3000 году до н.э. Их родиной считается Центральная Африка: Конго, Судан, Либерия. Местные жители использовали этих собак в качестве охотничьих: тонкий нюх, быстрота, смекалка и интерес к добыче делали басенджи незаменимыми помощниками. Порода пользовалась большой популярностью и в Египте: щенков преподносили царственным особам как ценный дар. В гробницах фараонов найдены изображения, фигурки и даже мумии этих собак. Египтяне верили, что басенджи отпугивают злых духов и привлекают к своему владельцу помощь светлых сил."
        )
        )
        dogList.add(
            CatDataClass(
                "https://www.proplan.ru/sites/owners.proplan.ru/files/styles/image_768x307/public/2021-01/shutterstock_231364474.webp?itok=cl8_MX2B",
                "Бернский зенненхунд",
                "Разводить эту породу начали не так давно – в начале 20-го века в Швейцарии, в городе Берн. Считается, что своим происхождением бернские зенненхунды, так же, как и все молоссы, обязаны тибетским мастифам.\n" +
                        "\n" +
                        "Слово «зенненхунд» в названии породы происходит от немецкого «зене» – альпийское пастбище, и «хунд» – собака."
        )
        )
        dogList.add(
            CatDataClass(
                "https://www.proplan.ru/sites/owners.proplan.ru/files/styles/image_768x307/public/2021-12/bigl_1970_2.webp?itok=sfQx67RB",
                "Бигль",
                "Существуют разные версии происхождения породы. Одна из них говорит о том, что к созданию этого вида гончих были причастны римляне, которые завезли их в свою северную английскую провинцию. Английская версия утверждает, что таких собак успешно разводили бритты задолго до того, как стать вассалами Римской империи. Согласно этой версии, бигли были верными спутниками рыцарей Круглого Стола. При этом все версии сходятся в том, что современный облик бигля определился именно в Англии."
        )
        )
        dogList.add(
            CatDataClass(
                "https://www.proplan.ru/sites/owners.proplan.ru/files/styles/article350x165/public/2020-03/bishon-frize_2.webp?itok=d6I6sjHh",
                "Бишон фризе",
                "«Бишон фризе» – название непривычное русскому уху, однако именно так правильно называть эту породу собак из группы бишонов. В России распространено так же название «французская болонка», однако правильно именно «бишон фризе». По одной из самых расхожих теорий предками бишонов фризе были корабельные собаки, которых моряки брали с собой на палубу для борьбы с грызунами. Их небольшой размер и плотная белая шерсть имели чисто утилитарное назначение, приспосабливая собачек к условиям южных плаваний."
        )
        )

        return dogList
    }

}